In [1]:
import pandas as pd
import numpy as np

In [2]:
# Criação de Dataframes - A partir de um array

In [4]:
arr = np.random.randint(10,55,size=(4,4))

In [5]:
arr

array([[27, 52, 39, 33],
       [50, 54, 37, 31],
       [40, 20, 42, 31],
       [39, 16, 36, 21]])

In [10]:
df1 = pd.DataFrame(data=arr,index=['a','b','c','d'],columns=['w','x','y','z']) # pd.DataFrame(dados,indices,colunas)

In [11]:
df1

    w   x   y   z
a  27  52  39  33
b  50  54  37  31
c  40  20  42  31
d  39  16  36  21

In [12]:
# A partir de Listas

In [13]:
lista = [[10,20,30,40,50],[60,70,80,90,100]]

In [20]:
df2 = pd.DataFrame(data=lista,index=['A','B'],columns=['V','W','X','Y','Z'])

In [21]:
df2

    V   W   X   Y    Z
A  10  20  30  40   50
B  60  70  80  90  100

In [23]:
# Ex.: Cadastro de DataFrames dos produtos de uma microempresa (Utilizando Dicionários)

In [27]:
dados = {'Produtos':['PS4','PC','Teclado','Mouse','Microfone'], 'Preço':[2600,2750,80,53.99,124.98]}

In [28]:
dados

{'Produtos': ['PS4', 'PC', 'Teclado', 'Mouse', 'Microfone'],
 'Preço': [2600, 2750, 80, 53.99, 124.98]}

In [25]:
df3 = pd.DataFrame(dados)

In [26]:
df3

    Produtos    Preço
0        PS4  2600.00
1         PC  2750.00
2    Teclado    80.00
3      Mouse    53.99
4  Microfone   124.98

In [29]:
# Criando uma nova coluna

In [30]:
df3['Custo'] = [1700,1850,60,39.99,95.98]

In [31]:
df3

    Produtos    Preço    Custo
0        PS4  2600.00  1700.00
1         PC  2750.00  1850.00
2    Teclado    80.00    60.00
3      Mouse    53.99    39.99
4  Microfone   124.98    95.98

In [32]:
df3['Lucro'] = df3['Preço'] - df3['Custo']

In [33]:
df3

    Produtos    Preço    Custo  Lucro
0        PS4  2600.00  1700.00  900.0
1         PC  2750.00  1850.00  900.0
2    Teclado    80.00    60.00   20.0
3      Mouse    53.99    39.99   14.0
4  Microfone   124.98    95.98   29.0